package cn.sherlock.List_Set;

public class Practice_3 {
    /*
    数据结构
    简述常见的数据结构中元素的存取特点。
    	栈：stack，又称堆栈，对元素的存取特点是：先进后出。
    即，存进去的元素，要在后它后面的元素依次取出后，才能取出该元素。
    	队列：queue，简称队，对元素的存取特点是：先进先出。
    即，存进去的元素，要在后它前面的元素依次取出后，才能取出该元素。
    	数组:Array，是有序的元素序列，对元素的存取特点是：
        1、查找元素快：通过索引，可以快速访问指定位置的元素
        2、增删元素慢
    （1）指定索引位置增加元素：需要创建一个新数组，
    将指定新元素存储在指定索引位置，再把原数组元素根据索引，
    复制到新数组对应索引的位置。
    （2）指定索引位置删除元素：需要创建一个新数组，
    把原数组元素根据索引，复
    制到新数组对应索引的位置，
    原数组中指定索引位置元素不复制到新数组中。
    	链表:linked list，对元素的存取有如下的特点：
    1、多个结点之间，通过地址进行连接。例如，多个人手拉手，
    每个人使用自己的右手拉住下个人的左手，依次类推，
    这样多个人就连在一起了。
    2、查找元素慢：想查找某个元素，需要通过连接的节点，
    依次向后查找指定元素。
    3、增删元素快：
    增加元素：只需要修改连接下个元素的地址即可。
    删除元素：只需要修改连接下个元素的地址即可。

     */
}
