package cn.sherlock.Class_Intro;

public class Practice_3 {
    /*
    ## 第三题：语法练习

    * 定义一个日期MyDate类。
  - 属性：
    - year：年
    - month：月
    - day：日
  - 构造方法：
    - 满参构造方法
  - 成员方法：
    - get/set方法
    - showDate方法：打印日期。
    - isBi方法：判断当前日期是否是闰年
    * 定义测试类，创建MyDate对象，并测试。


    - 代码实现，效果如图所示：

    ![](img/3.jpg)

    - 开发提示：

    - 闰年：
    - 普通年（不能被100整除的年份）
      能被4整除的为闰年。
     （如2004年就是闰年,1999年不是闰年）；
    - 世纪年（能被100整除的年份）
      能被400整除的是闰年。
      (如2000年是闰年，1900年不是闰年)；

     */

}
