package cn.sherlock.Const_Varible;

public class Practice_1 {
    /*
    编写步骤：

    1. 定义类 Test1
    2. 定义 main方法
    3. 控制台输出5行字符串类型常量值
    4. 控制台输出5行字符类型常量值

    * 编写步骤：

    1. 定义类 Test2
    2. 定义 main方法
    3. 控制台输出5行整数类型常量值
    4. 控制台输出5行小数类型常量值

    - 编写步骤：

    1. 定义类 Test3
    2. 定义 main方法
    3. 控制台输出所有布尔类型常量值

    - 编写步骤：

    1. 定义类 Test4
    2. 定义 main方法
    3. 定义2个 byte类型变量,分别赋byte类型范围内最大值和最小值,并输出在控制台. -127——128
    4. 定义2个 short类型变量,分别赋short类型范围内的值,并输出在控制台. -32768——32767
    5. 定义2个 int类型变量,分别赋int类型范围内的值,并输出在控制台. -2147483648——2147483647
    6. 定义2个 long类型变量,分别赋超过int类型范围的值,并输出在控制台. -2147483649L——2147483648L

    * 编写步骤：
    1. 定义类 Test5
    2. 定义 main方法
    3. 定义2个 float类型变量,分别赋值,并输出在控制台.
    4. 定义2个 double类型变量,分别赋值,并输出在控制台.

            float num1 = -3.14F;
            float num2 = 3.14F;

            double num3 = -3.4;
            double num4 = 3.4;


    - 编写步骤：

    1. 定义类 Test6
    2. 定义 main方法
    3. 定义5个 char类型变量,分别赋值,并输出在控制台.
    4. 定义2个 boolean类型变量,分别赋值,并输出在控制台.


    - 编写步骤：

    1. 定义类 Test7
    2. 定义 main方法
    3. 定义两个整数变量a，b并赋值
    4. 控制台输出变量a，b互换前的值
    5. 定义一个第三方变量temp，不赋值
    6. 利用第三方变量temp使a，b的值互换
    7. 控制台输出变量a，b互换后的值

    */
}
