package cn.sherlock.Interface_Polymorphic;

public class Test1 {
    /*

    基本类型
        指的是保存在 栈 内存中的简单数据段

    引用类型
        指的是那些保存在 堆 内存中的对象,变量中保存的实际上只是一个指针 该指针指向内存中的另一个位置 在这个位置里面保存真正的数据

    概念辨析

    1. 什么是接口，如何定义接口？
       * 接口，是Java语言中一种引用类型，是方法的集合。
       * 使用interface关键定义接口，其中可以定义抽象方法，默认方法，私有方法，静态方法等方法。
    2. 什么叫做多态，条件是什么？
       * 一类事物的行为，具有多种表现形式。
       * 条件：
         * 继承或者实现【二选一】
         * 方法的重写。
         * 父类引用指向子类对象。
    3. 使用多态特性，带来了什么样的好处？
       * 增强方法的扩展性和复用性。
    4. 使用多态特性，注意什么样的弊端？
       * 由于类型的提升，导致调用子类对象特有的方法，必须向下转型。

     */

    public static void main(String[] args) {

    }
}
